In [2]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv("C:\\Users\\punith yc\\Downloads\\walmart-sales-dataset-of-45stores.csv")

In [4]:
data

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [5]:
data.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106

In [6]:
data.tail()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [7]:
len(data)

6435

In [8]:
len(data['Date'])

6435

In [9]:
data.columns

Index(['Store', 'Date', 'Weekly_Sales', 'Holiday_Flag', 'Temperature',
       'Fuel_Price', 'CPI', 'Unemployment'],
      dtype='object')

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6435 entries, 0 to 6434
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         6435 non-null   int64
 1   Date          6435 non-null   object
 2   Weekly_Sales  6435 non-null   float64
 3   Holiday_Flag  6435 non-null   int64
 4   Temperature   6435 non-null   float64
 5   Fuel_Price    6435 non-null   float64
 6   CPI           6435 non-null   float64
 7   Unemployment  6435 non-null   float64
dtypes: float64(5), int64(2), object(1)
memory usage: 402.3+ KB

In [11]:
data.describe(include='all')

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
count,6435.000000,6435,6.435000e+03,6435.000000,6435.000000,6435.000000,6435.000000,6435.000000
unique,NaN,143,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,05-02-2010,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,45,NaN,NaN,NaN,NaN,NaN,NaN
mean,23.000000,NaN,1.046965e+06,0.069930,60.663782,3.358607,171.578394,7.999151
std,12.988182,NaN,5.643666e+05,0.255049,18.444933,0.459020,39.356712,1.875885
min,1.000000,NaN,2.099862e+05,0.000000,-2.060000,2.472000,126.064000,3.879000
25%,12.000000,NaN,5.533501e+05,0.000000,47.460000,2.933000,131.735000,6.891000
50%,23.000000,NaN,9.607460e+05,0.000000,62.670000,3.445000,182.616521,7.874000
75%,34.000000,NaN,1.420159e+06,0.000000,74.940000,3.735000,212.743293,8.622000
max,45.000000,NaN,3.818686e+06,1.000000,100.140000,4.468000,227.232807,14.313000

In [12]:
data.describe()

,Store,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
count,6435.000000,6.435000e+03,6435.000000,6435.000000,6435.000000,6435.000000,6435.000000
mean,23.000000,1.046965e+06,0.069930,60.663782,3.358607,171.578394,7.999151
std,12.988182,5.643666e+05,0.255049,18.444933,0.459020,39.356712,1.875885
min,1.000000,2.099862e+05,0.000000,-2.060000,2.472000,126.064000,3.879000
25%,12.000000,5.533501e+05,0.000000,47.460000,2.933000,131.735000,6.891000
50%,23.000000,9.607460e+05,0.000000,62.670000,3.445000,182.616521,7.874000
75%,34.000000,1.420159e+06,0.000000,74.940000,3.735000,212.743293,8.622000
max,45.000000,3.818686e+06,1.000000,100.140000,4.468000,227.232807,14.313000

In [13]:
data.describe(include='object')

              Date
count         6435
unique         143
top     05-02-2010
freq            45

In [14]:
data.describe(include='float')

       Weekly_Sales  Temperature   Fuel_Price          CPI  Unemployment
count  6.435000e+03  6435.000000  6435.000000  6435.000000   6435.000000
mean   1.046965e+06    60.663782     3.358607   171.578394      7.999151
std    5.643666e+05    18.444933     0.459020    39.356712      1.875885
min    2.099862e+05    -2.060000     2.472000   126.064000      3.879000
25%    5.533501e+05    47.460000     2.933000   131.735000      6.891000
50%    9.607460e+05    62.670000     3.445000   182.616521      7.874000
75%    1.420159e+06    74.940000     3.735000   212.743293      8.622000
max    3.818686e+06   100.140000     4.468000   227.232807     14.313000

In [15]:
data.describe(include='int')

             Store  Holiday_Flag
count  6435.000000   6435.000000
mean     23.000000      0.069930
std      12.988182      0.255049
min       1.000000      0.000000
25%      12.000000      0.000000
50%      23.000000      0.000000
75%      34.000000      0.000000
max      45.000000      1.000000

In [16]:
data.shape

(6435, 8)

In [17]:
data['Holiday_Flag'].unique()

array([0, 1], dtype=int64)

In [18]:
my_list=[10,23,4,5]

In [19]:
pd.DataFrame(my_list,columns=['sbc'],index=[1,2,3,4])

   sbc
1   10
2   23
3    4
4    5

In [20]:
my_list2={'name':['abc','wefnn','ffe','fehyuwf','dsnbfj'],'rollno':[23,4,5,7,6]}

In [21]:
data2=pd.DataFrame(my_list2,index=[1,2,3,4,5])

In [22]:
data2

      name  rollno
1      abc      23
2    wefnn       4
3      ffe       5
4  fehyuwf       7
5   dsnbfj       6

In [23]:
pd.Series(my_list,name='table1',index=[1,2,3,4])

1    10
2    23
3     4
4     5
Name: table1, dtype: int64

In [24]:
data

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [25]:
data.iloc[0][2]

1643690.9

In [26]:
data.loc[0][2]

1643690.9

In [27]:
data2.set_index('name',inplace=True)

In [28]:
data2

         rollno
name
abc          23
wefnn         4
ffe           5
fehyuwf       7
dsnbfj        6

In [29]:
data2.reset_index(inplace=True)

In [30]:
data2

      name  rollno
0      abc      23
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6

In [31]:
d=[2,3,45,67,87]

In [32]:
data2.reindex(d)

       name  rollno
2       ffe     5.0
3   fehyuwf     7.0
45      NaN     NaN
67      NaN     NaN
87      NaN     NaN

In [33]:
data2

      name  rollno
0      abc      23
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6

In [34]:
data

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [35]:
greater=data['CPI']>200]

SyntaxError: unmatched ']' (51663493.py, line 1)

In [36]:
greater

NameError: name 'greater' is not defined

In [37]:
data.loc[data['CPI']>200]

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6144,43,28-09-2012,577792.32,0,77.55,3.666,214.305250,9.285
6145,43,05-10-2012,642614.89,0,74.09,3.617,214.491267,8.839
6146,43,12-10-2012,619369.72,0,71.14,3.601,214.677283,8.839
6147,43,19-10-2012,623919.23,0,71.25,3.594,214.721249,8.839
6148,43,26-10-2012,587603.55,0,69.17,3.506,214.741539,8.839

In [38]:
data.loc[data['CPI']>200]

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6144,43,28-09-2012,577792.32,0,77.55,3.666,214.305250,9.285
6145,43,05-10-2012,642614.89,0,74.09,3.617,214.491267,8.839
6146,43,12-10-2012,619369.72,0,71.14,3.601,214.677283,8.839
6147,43,19-10-2012,623919.23,0,71.25,3.594,214.721249,8.839
6148,43,26-10-2012,587603.55,0,69.17,3.506,214.741539,8.839

In [39]:
data2

      name  rollno
0      abc      23
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6

In [40]:
data2['nameroll']=data2['name']+str(data2['rollno'])

In [41]:
data2

      name  rollno                                           nameroll
0      abc      23  abc0    23\n1     4\n2     5\n3     7\n4     6...
1    wefnn       4  wefnn0    23\n1     4\n2     5\n3     7\n4    ...
2      ffe       5  ffe0    23\n1     4\n2     5\n3     7\n4     6...
3  fehyuwf       7  fehyuwf0    23\n1     4\n2     5\n3     7\n4  ...
4   dsnbfj       6  dsnbfj0    23\n1     4\n2     5\n3     7\n4   ...

In [42]:
data2.drop(columns='nameroll',inplace=True)

In [43]:
data2

      name  rollno
0      abc      23
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6

In [44]:
data2.drop(0,axis=0,inplace=True)

In [45]:
data2

      name  rollno
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6

In [46]:
da={'name':'dvbh','rollno':8}

In [47]:
data2.loc[5]=da

In [48]:
data2

      name  rollno
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6
5     dvbh       8

In [49]:
data

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [50]:
data['Fuel_Price'].mean()

3.358606837606838

In [51]:
data['Fuel_Price'].max()

4.468

In [52]:
data['Fuel_Price'].min()

2.472

In [53]:
data['Fuel_Price'].count()

6435

In [54]:
data.index

RangeIndex(start=0, stop=6435, step=1)

In [55]:
data.size

51480

In [56]:
data.shape

(6435, 8)

In [57]:
data['Store'].is_unique

False

In [58]:
data['Fuel_Price'].is_monotonic_decreasing

False

In [59]:
data['Fuel_Price'].is_monotonic_increasing

False

In [60]:
data2.value_counts()

name     rollno
dsnbfj   6         1
dvbh     8         1
fehyuwf  7         1
ffe      5         1
wefnn    4         1
Name: count, dtype: int64

In [61]:
data2.sort_values(by='rollno',ascending=False)

      name  rollno
5     dvbh       8
3  fehyuwf       7
4   dsnbfj       6
2      ffe       5
1    wefnn       4

In [62]:
data.dropna()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [63]:
data.fillna(0)

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106
...,...,...,...,...,...,...,...,...
6430,45,28-09-2012,713173.95,0,64.88,3.997,192.013558,8.684
6431,45,05-10-2012,733455.07,0,64.89,3.985,192.170412,8.667
6432,45,12-10-2012,734464.36,0,54.47,4.000,192.327265,8.667
6433,45,19-10-2012,718125.53,0,56.47,3.969,192.330854,8.667
6434,45,26-10-2012,760281.43,0,58.85,3.882,192.308899,8.667

In [64]:
data['Weekly_Sales'].mean()

1046964.8775617715

In [65]:
data['Weekly_Sales'].median()

960746.04

In [66]:
data['Weekly_Sales'].var()

318509684088.3009

In [67]:
data['Weekly_Sales'].std()

564366.6220536974

In [68]:
data['Weekly_Sales'].max()

3818686.45

In [69]:
data['Weekly_Sales'].min()

209986.25

In [70]:
data['Weekly_Sales'].skew()

0.6683617974864524

In [71]:
data2

      name  rollno
1    wefnn       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6
5     dvbh       8

In [72]:
data2['name'].replace('wefnn','abc',inplace=True)

In [73]:
data2

      name  rollno
1      abc       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6
5     dvbh       8

In [74]:
data2['name'].str.lower()

1        abc
2        ffe
3    fehyuwf
4     dsnbfj
5       dvbh
Name: name, dtype: object

In [75]:
data2['name'].str.upper()

1        ABC
2        FFE
3    FEHYUWF
4     DSNBFJ
5       DVBH
Name: name, dtype: object

In [76]:
data2['name'].str.strip()

1        abc
2        ffe
3    fehyuwf
4     dsnbfj
5       dvbh
Name: name, dtype: object

In [77]:
data2['name'].str.lstrip()

1        abc
2        ffe
3    fehyuwf
4     dsnbfj
5       dvbh
Name: name, dtype: object

In [78]:
data2['name'].str.rstrip()

1        abc
2        ffe
3    fehyuwf
4     dsnbfj
5       dvbh
Name: name, dtype: object

In [79]:
data2['name'].count()

5

In [80]:
data2['name'].str.title()

1        Abc
2        Ffe
3    Fehyuwf
4     Dsnbfj
5       Dvbh
Name: name, dtype: object

In [81]:
data2['name'].str.capitalize()

1        Abc
2        Ffe
3    Fehyuwf
4     Dsnbfj
5       Dvbh
Name: name, dtype: object

In [82]:
data2['name'].str.len()

1    3
2    3
3    7
4    6
5    4
Name: name, dtype: int64

In [83]:
data2['name'].str.swapcase()

1        ABC
2        FFE
3    FEHYUWF
4     DSNBFJ
5       DVBH
Name: name, dtype: object

In [84]:
data2['name'].str.contains('a')

1     True
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [85]:
data2['rollno'].rolling(2).sum()

1     NaN
2     9.0
3    12.0
4    13.0
5    14.0
Name: rollno, dtype: float64

In [86]:
data2['rollno'].expanding().sum()

1     4.0
2     9.0
3    16.0
4    22.0
5    30.0
Name: rollno, dtype: float64

In [87]:
def func(data2):
    return data2*2

In [88]:
data2.apply(func,axis=1)

             name  rollno
1          abcabc       8
2          ffeffe      10
3  fehyuwffehyuwf      14
4    dsnbfjdsnbfj      12
5        dvbhdvbh      16

In [89]:
def func_name(data2):
    return data2*3

In [90]:
data2.apply(func_name,axis=1)

                    name  rollno
1              abcabcabc      12
2              ffeffeffe      15
3  fehyuwffehyuwffehyuwf      21
4     dsnbfjdsnbfjdsnbfj      18
5           dvbhdvbhdvbh      24

In [91]:
my_list

[10, 23, 4, 5]

In [92]:
pd.Series(my_list,name="abc")

0    10
1    23
2     4
3     5
Name: abc, dtype: int64

In [93]:
def funct(abc):
    return abc*3

In [94]:
data2

      name  rollno
1      abc       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6
5     dvbh       8

In [95]:
data2.groupby('name').rollno.sum()

name
abc        4
dsnbfj     6
dvbh       8
fehyuwf    7
ffe        5
Name: rollno, dtype: int64

In [100]:
data.groupby('Store').Weekly_Sales.sum().max()

301397792.46

In [102]:
data2

      name  rollno
1      abc       4
2      ffe       5
3  fehyuwf       7
4   dsnbfj       6
5     dvbh       8

In [105]:
data2['name'].nunique()

5